tutorials/laminarCounterFlowFlame-2D/GRI30/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    //mixture         SRKchungKineticReactingMixture;
    mixture         SRKchungTakaReactingMixture;
    //mixture         PRchungTakaReactingMixture;
    //mixture         PRchungKineticReactingMixture;
    //transport       chungKinetic;
    transport       chungTaka;
    thermo          rfJanaf;
    energy          sensibleEnthalpy;
    equationOfState soaveRedlichKwong;
    //equationOfState PengRobinson;
    specie          rfSpecie;
}

// for ideal gas
/*
thermoType
{
    type            hePsiThermo;
    mixture         idKineticReactingMixture;
    transport       sutherlandKinetic;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}
*/

inertSpecie CO2;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactionsGRI";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.inputData_GRI";


// ************************************************************************* //
